Tekla.Structures.Model.RebarLegFace
Defines a rebar leg face that is used in a Tekla.Structures.Model.RebarSet.
Rebar leg faces control how the Tekla.Structures.Model.RebarSet generates the reinforcing bars.

Tekla.Structures.Model.RebarLegFace.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarLegFace class.

Tekla.Structures.Model.RebarLegFace.#ctor(Tekla.Structures.Model.Contour)
Initializes a new instance of the Tekla.Structures.Model.RebarLegFace class using the specified Tekla.Structures.Model.RebarLegFace.Contour.
contour: The primary contour.

Tekla.Structures.Model.RebarLegFace.Id
Gets or sets an identifier that may be used to identify instances of the same rebar leg face.

Tekla.Structures.Model.RebarLegFace.OffsetType
Gets or sets the type of offset used to apply the offset value.

Tekla.Structures.Model.RebarLegFace.Offset
Gets or sets the user defined offset of the rebars from the rebar leg face.

Tekla.Structures.Model.RebarLegFace.AdditonalOffset
Gets or sets the user defined offset of the rebars from the rebar leg face.
Deprecated since TS2026, please use Offset instead.

Tekla.Structures.Model.RebarLegFace.LayerOrderNumber
Gets or sets the layer order number of the rebar leg face.

Tekla.Structures.Model.RebarLegFace.Reversed
Gets or sets a value indicating whether the cover thickness is opposite to the coordinate system Z direction for the rebar leg face.

Tekla.Structures.Model.RebarLegFace.Contour
Gets or sets the outer Tekla.Structures.Model.RebarLegFace.Contour of the rebar leg face.

Tekla.Structures.Model.RebarLegFace.Frozen
Gets a value indicating whether the leg face is frozen or not.